# NotEnoughRoomForParallelPipes Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ElectricalFailures..::..NotEnoughRoomForParallelPipes Property
BuiltInFailures..::..ElectricalFailures Class See Also
---
Due to changes in elevation, there is not enough room to generate all of the parallel pipes. As a result, some pipe segments have not been generated.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NotEnoughRoomForParallelPipes { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NotEnoughRoomForParallelPipes As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NotEnoughRoomForParallelPipes {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ElectricalFailures Class
Autodesk.Revit.DB Namespace